petalgram/app/Models/ProductModel.php

SELECT `products`.*, `categories`.`name` as `category_name`, `categories`.`icon` as `category_icon`
FROM `products`
LEFT JOIN `categories` ON `categories`.`id` = `products`.`category_id`
ORDER BY `products`.`id` DESC
---
    public function getProductsWithCategory()
    {
        return $this->select('products.*, categories.name as category_name, categories.icon as category_icon')
            ->join('categories', 'categories.id = products.category_id', 'left')
            ->orderBy('products.id', 'DESC')
            ->findAll();