petalgram/app/Controllers/Home.php

SELECT *
FROM `categories`
---
    public function index()
    {
        $productModel = new ProductModel();
        $categoryModel = new CategoryModel();

        $data['products'] = $productModel->getProductsWithCategory();
        $data['categories'] = $categoryModel->findAll();